# InvalidTopConstraintForLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..InvalidTopConstraintForLevel Property
BuiltInFailures..::..WallFailures Class See Also
---
Top Constraint is invalid for the Level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidTopConstraintForLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidTopConstraintForLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidTopConstraintForLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace